[
    {
        "id": 1,
        "title": "Missão Impossível - O Acerto Final",
        "duration": "2h 49min",
        "genre": "Ação",
        "director": "Christopher McQuarrie",
        "actors": "Tom Cruise, Hayley Atwell, Simon Pegg",
        "synopsis": "No novo filme Missão Impossível - O Acerto Final, Ethan Hunt (Tom Cruise) é acompanhado, pela oitava vez, nos acontecimentos que sucederam a missão dela ao lado da sua tripulação do FMI para impedir as consequências trágicas de uma nova ameaça inimaginável: a Inteligência Artificial no sistema global de computadores. Tendo a certeza de que nossas vidas são definidas pela soma das nossas escolhas, Ethan continua sua busca pela entidade responsável, mas acaba se deparando com grandes governantes poderosos ao redor do mundo que utilizam a tecnologia para dominar e oprimir centenas de pessoas. Dirigido por Christopher McQuarrie, agora Ethan se encontrará com novos aliados para essa importante missão. Em uma corrida contra o tempo, ele precisará definir o resultado do destino da realidade que conhecemos hoje em dia, no entanto, enquanto o mundo balança entre o caos e o controle absoluto, ele precisará enfrentar arqui inimigos que atormentaram o seu passado tentando o destruir outra vez.",
        "cover": "mi-acerto-final.png",
        "rated": 4
    },
    {
        "id": 2,
        "title": "Lilo & Stitch",
        "duration": "1h 48min",
        "genre": "Aventura",
        "director": "Dean Fleischer Camp",
        "actors": "Chris K.T. Bright, Mike Van Waes",
        "synopsis": "Live-action do famoso clássico de animação da Disney, Lilo & Stitch conta a história da amizade entre uma jovem menina humana e um alienígena fugitivo que parece um cachorro. Stitch (Chris Sanders), o experimento 626, é um extraterrestre expressivo que é adotado como animal de estimação por Lilo (Maia Kealoha), uma imaginativa e rebelde garota havaiana, e juntos eles descobrem o significado de família. O jeito extrovertido de Lilo mais do que corresponde à energia caótica do pequeno monstro peludo e impulsivo que está sendo caçado pelos agentes da Federação Galáctica Unida. A amizade incomum entre os dois provoca uma série de confusões e problemas até com a assistente social que cuida de Lilo, observando seu bem-estar ao lado da irmã Nani, sua tutora legal desde a morte dos pais.",
        "cover": "lilo-stitch.jpg",
        "rated": 3
    },
    {
        "id": 3,
        "title": "Star Wars: O Despertar da Força",
        "duration": "2h 15min",
        "genre": "Ficção Científica",
        "director": "J.J. Abrams",
        "actors": "Daisy Ridley, John Boyega, Adam Driver",
        "synopsis": "Em Star Wars: Episódio VII, décadas após a queda de Darth Vader e do Império, surge uma nova ameaça: a Primeira Ordem, uma organização sombria que busca minar o poder da República e que tem Kylo Ren (Adam Driver), o General Hux (Domhnall Gleeson) e o Líder Supremo Snoke (Andy Serkis) como principais expoentes. Eles conseguem capturar Poe Dameron (Oscar Isaac), um dos principais pilotos da Resistência, que antes de ser preso envia através do pequeno robô BB-8 o mapa de onde vive o mitológico Luke Skywalker (Mark Hamill). Ao fugir pelo deserto, BB-8 encontra a jovem Rey (Daisy Ridley), que vive sozinha catando destroços de naves antigas. Paralelamente, Poe recebe a ajuda de Finn (John Boyega), um stormtrooper que decide abandonar o posto repentinamente. Juntos, eles escapam do domínio da Primeira Ordem.",
        "cover": "star-wars-despertar-da-forca.jpg",
        "rated": 5
    },
    {
        "id": 4,
        "title": "Homem com H",
        "duration": "2h 09min",
        "genre": "Biopic",
        "director": "Esmir Filho",
        "actors": "Jesuíta Barbosa, Bruno Montaleone, Jullio Reis",
        "synopsis": "Cinebiografia de Ney Matogrosso, Homem com H apresenta a intensa trajetória do artista desde a infância até se tornar uma das grandes figuras da música e cultura brasileiras. O filme acompanha a origem em Bela Vista no Mato Grosso do Sul e os constantes embates familiares em razão dos preconceitos de seu pai. Ao sair de casa e se mudar para São Paulo, Ney dá início à sua carreira artística. Com uma voz única e uma veia criativa e performática inesquecível, Ney Matogrosso compõe um terço da banda Secos & Molhados e enfileira sucessos como Rosa de Hiroshima e Sangue Latino em meio à repressão da ditadura militar. Passando por cada fase de sua carreira, Homem com H conta a história de vida de um ícone artístico, demonstra sua identidade revolucionária e arrebatadora, seu ímpeto libertário e sua inconfundível presença de palco.",
        "cover": "homem-com-h.jpg",
        "rated": 4
    },
    {
        "id": 5,
        "title": "Top Gun: Maverick",
        "duration": "2h 11min",
        "genre": "Ação",
        "director": "Joseph Kosinski",
        "actors": "Tom Cruise, Miles Teller, Jennifer Connelly",
        "synopsis": "Na sequência de Top Gun: Ases Indomáveis, acompanhamos a história de Pete “Maverick” Mitchell (Tom Cruise), um piloto à moda antiga da Marinha que coleciona muitas condecorações, medalhas de combate e grande reconhecimento pela quantidade de aviões inimigos abatidos nos últimos 30 anos. Entretanto, nada disso foi suficiente para sua carreira decolar, visto que ele deixou de ser um capitão e tornou-se um instrutor. A explicação para esse declínio é simples: Ele continua sendo o mesmo piloto rebelde de sempre, que não hesita em romper os limites e desafiar a morte. Nesta nova aventura, Maverick precisa provar que o fator humano ainda é fundamental no mundo contemporâneo das guerras tecnológicas. Após 34 anos do clássico, acompanhem o filme do premiado produtor Jerry Bruckheimer e de Joseph Kosinski, mesmo diretor de Tron: O Legado (2010) e Oblivion (2013).",
        "cover": "top-gun-maverick.jpg",
        "rated": 5
    },
    {
        "id": 6,
        "title": "Deadpool",
        "duration": "1h 48min",
        "genre": "Ação",
        "director": "Tim Miller",
        "actors": "Ryan Reynolds, Morena Baccarin, Ed Skrein",
        "synopsis": "Ex-militar e mercenário, Wade Wilson (Ryan Reynolds) é diagnosticado com câncer em estado terminal, porém encontra uma possibilidade de cura em uma sinistra experiência científica. Recuperado, com poderes e um incomum senso de humor, ele torna-se Deadpool e busca vingança contra o homem que destruiu sua vida.",
        "cover": "deadpool.jpg",
        "rated": 4
    },
    {
        "id": 7,
        "title": "Oppenheimer",
        "duration": "3h 01min",
        "genre": "Biopic",
        "director": "Christopher Nolan",
        "actors": "Cillian Murphy, Emily Blunt, Matt Damon",
        "synopsis": "Oppenheimer é um filme histórico de drama dirigido por Christopher Nolan e baseado no livro biográfico vencedor do Prêmio Pulitzer, Prometeu Americano: O Triunfo e a Tragédia de J. Robert Oppenheimer, escrito por Kai Bird e Martin J. Sherwin. Ambientado na Segunda Guerra Mundial, o longa acompanha a vida de J. Robert Oppenheimer (Cillian Murphy), físico teórico da Universidade da Califórnia e diretor do Laboratório de Los Alamos durante o Projeto Manhattan - que tinha a missão de projetar e construir as primeiras bombas atômicas. A trama acompanha o físico e um grupo formado por outros cientistas ao longo do processo de desenvolvimento da arma nuclear que foi responsável pelas tragédias nas cidades de Hiroshima e Nagasaki, no Japão, em 1945. Além de Cillian, o elenco também traz nomes como Emily Blunt, Matt Damon, Robert Downey Jr., Florence Pugh, Gary Oldman, Jack Quaid, Gustaf Skarsgård, Rami Malek e Kenneth Branagh.",
        "cover": "oppenheimer.jpg",
        "rated": 5
    }
]
